pet_examples/evaluation/model_comp_corr/gpt3/mermaid/rulact_bpmn/10_13.mmd
graph LR
1((startevent)) --> 2(INQ transmits request)
2 --> 3(IP checks request)
3 --> 4(IP answers question)
4 --> 5(Transmission of data)
4 --> 6(Rejection)
5 --> 7((endevent))
6 --> 7((endevent))
